name: "ResNet-101"

layer {
  name: "data"
  type: "Data"
  top: "data"
  transform_param {
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  data_param {
    source: "path/to/train_data/lmdb"  # LMDB or leveldb path
    batch_size: 64
    backend: LMDB
  }
}

# Add ResNet-101 architecture layers here

layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc1000"
  bottom: "label"
  top: "loss"
}

# Add accuracy layer if needed
